app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "description", "image_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-06-04 21:53:03.523980"], ["description", "Dinneer"], ["image_id", ""], ["name", "Dinner"], ["updated_at", "2015-06-04 21:53:03.523980"]]
---
  def create
    @category = Category.new(category_params)
    @category.save