app/controllers/checkins_controller.rb

  def index
    @checkins = Checkin.all
---
SELECT "checkins".* FROM "checkins"

  def show_by_user_id
    @checkins = Checkin.find_by_user_id(params[:user_id])
---
SELECT  "checkins".* FROM "checkins"  WHERE "checkins"."user_id" = '1' LIMIT 1

  def show
    @checkin = Checkin.find(params[:id])
---
SELECT  "checkins".* FROM "checkins"  WHERE "checkins"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @checkin = Checkin.find(params[:id])
---
SELECT  "checkins".* FROM "checkins"  WHERE "checkins"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @checkin = Checkin.new(checkin_params)
    @checkin.save
    @user = User.find_by_fb_id(@checkin.user_id)
    @category = Category.find_by_id(@checkin.category_id)
    @user.update_attributes(:score => (@user.score + @category.score))
---
INSERT INTO "checkins" ("category_id", "category_name", "created_at", "date_time", "description", "ingredients", "picture", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users"  WHERE "users"."fb_id" = '766454766737144' LIMIT 1
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = 1 LIMIT 1
UPDATE "users" SET "score" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["score", 10], ["updated_at", "2015-01-13 23:11:46.425895"]]

  def update
    @checkin.update(checkin_params)
---
UPDATE "checkins" SET "category_name" = ?, "ingredients" = ?, "updated_at" = ? WHERE "checkins"."id" = 2  [["category_name", "Soups"], ["ingredients", "chicken, water, poatatoe"], ["updated_at", "2015-06-02 21:35:24.394872"]]

    def set_checkin
      @checkin = Checkin.find(params[:id])
---
SELECT  "checkins".* FROM "checkins"  WHERE "checkins"."id" = ? LIMIT 1  [["id", 2]]