app/controllers/ingredients_controller.rb

  def create
    @ingredient = Ingredient.new(ingredient_params)

    respond_to do |format|
      if @ingredient.save
---
INSERT INTO "ingredients" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-06-02 17:34:06.660032"], ["name", "Faina"], ["updated_at", "2015-06-02 17:34:06.660032"]]

  def update
    respond_to do |format|
      if @ingredient.update(ingredient_params)
---
UPDATE "ingredients" SET "calories" = ?, "price" = ?, "updated_at" = ? WHERE "ingredients"."id" = 1  [["calories", 300], ["price", "12"], ["updated_at", "2015-06-02 18:42:00.243550"]]

    def set_ingredient
      @ingredient = Ingredient.find(params[:id])
---
SELECT  "ingredients".* FROM "ingredients"  WHERE "ingredients"."id" = ? LIMIT 1  [["id", 3]]