app/controllers/plans_controller.rb

SELECT  "plans".* FROM "plans"  WHERE "plans"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @plan = Plan.find(params[:id])

INSERT INTO "plans" ("created_at", "date_time", "name", "plan_details", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @plan = Plan.new(plan_params)
    @plan.save