app/controllers/receipe_ingredients_controller.rb

  def index
    @receipe_ingredients = ReceipeIngredient.all
---
SELECT "receipe_ingredients".* FROM "receipe_ingredients"

  def create
    @receipe_ingredient = ReceipeIngredient.new(receipe_ingredient_params)

    respond_to do |format|
      if @receipe_ingredient.save
---
INSERT INTO "receipe_ingredients" ("created_at", "ingredient_id", "receipe_id", "string", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-06-02 21:14:25.095091"], ["ingredient_id", "1"], ["receipe_id", "1"], ["string", ""], ["updated_at", "2015-06-02 21:14:25.095091"]]

    def set_receipe_ingredient
      @receipe_ingredient = ReceipeIngredient.find(params[:id])
---
SELECT  "receipe_ingredients".* FROM "receipe_ingredients"  WHERE "receipe_ingredients"."id" = ? LIMIT 1  [["id", 1]]