app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."category_id" = 3 LIMIT 1
---
  def show_by_category_id
    @recipes = Recipe.find_by_category_id(params[:category_id])

INSERT INTO "recipes" ("category_id", "created_at", "description", "message", "name", "score", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["category_id", 2], ["created_at", "2015-06-01 10:20:15.275747"], ["description", ""], ["message", ""], ["name", ""], ["score", 2], ["updated_at", "2015-06-01 10:20:15.275747"]]
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.save

UPDATE "recipes" SET "category_name" = ?, "ingredients" = ?, "name" = ?, "updated_at" = ? WHERE "recipes"."id" = 1  [["category_name", ""], ["ingredients", ""], ["name", "hey"], ["updated_at", "2015-06-14 20:20:51.141385"]]
---
  def update
      #@recipe = Recipe.find(params[:id])
      #@recipe.update_attributes(params[:user])
    @recipe.update(recipe_params)