app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."fb_id" = '123478' LIMIT 1
---
  def show_by_fb_id
    @users = User.find_by_fb_id(params[:fb_id])

SELECT  "users".* FROM "users"  WHERE "users"."fb_id" = '1234' LIMIT 1
INSERT INTO "users" ("created_at", "fb_id", "first_name", "last_name", "score", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-12-06 20:25:26.072782"], ["fb_id", "1234"], ["first_name", "ana"], ["last_name", "vasilescu"], ["score", 10], ["updated_at", "2014-12-06 20:25:26.072782"]]
---
  def create
    @user = User.new(user_params)
    @same_fb_id = User.find_by_fb_id(@user.fb_id)
    if @same_fb_id == nil
      @user.save

UPDATE "users" SET "fb_id" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["fb_id", "123478"], ["updated_at", "2014-12-18 14:50:42.392085"]]
---
  def update
    @user.update(user_params)